MaurinElectroTextile/Active_matrix/Proto_2_v_3_1.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\CyLib.h
#define FTW_CLEAR_ALL_BITS                0x00u /*To clear all bits of PM_TW_CFG2*/
#define FTW_CLEAR_FTW_BITS                0xFCu /*To clear FTW bits of PM_TW_CFG2*/
#define FTW_ENABLE                        0x01u /*To enable FTW, no interrupt*/

/***************************************
* Registers
***************************************/
#define FASTCLK_PLL_CFG0_PTR           ( (reg8 *) CYREG_FASTCLK_PLL_CFG0)
#define FASTCLK_PLL_CFG0            (*(reg8 *) CYREG_FASTCLK_PLL_CFG0) 
#define FASTCLK_PLL_SR_PTR          ( (reg8 *) CYREG_FASTCLK_PLL_SR)
#define FASTCLK_PLL_SR              (*(reg8 *) CYREG_FASTCLK_PLL_SR)
#define PM_ACT_CFG0_PTR             ( (reg8 *) CYREG_PM_ACT_CFG0)
#define PM_ACT_CFG0                 (*(reg8 *) CYREG_PM_ACT_CFG0)
#define PM_STBY_CFG0_PTR               ( (reg8 *) CYREG_PM_STBY_CFG0)
#define PM_STBY_CFG0                 (*(reg8 *) CYREG_PM_STBY_CFG0)
#define PM_AVAIL_CR2_PTR             ( (reg8 *) CYREG_PM_AVAIL_CR2)
#define PM_AVAIL_CR2                 (*(reg8 *) CYREG_PM_AVAIL_CR2)
#define FASTCLK_XMHZ_CSR_PTR           ( (reg8 *) CYREG_FASTCLK_XMHZ_CSR)
#define FASTCLK_XMHZ_CSR               (*(reg8 *) CYREG_FASTCLK_XMHZ_CSR)
#define SLOWCLK_X32_CR_PTR            ( (reg8 *) CYREG_SLOWCLK_X32_CR)
#define SLOWCLK_X32_CR                (*(reg8 *) CYREG_SLOWCLK_X32_CR)
#define MFGCFG_X32_TR_PTR            ( (reg8 *) CYDEV_MFGCFG_X32_TR)
#define MFGCFG_X32_TR                (*(reg8 *) CYDEV_MFGCFG_X32_TR)
#define SLOWCLK_X32_TST_PTR            ( (reg8 *) CYDEV_SLOWCLK_X32_TST)
#define SLOWCLK_X32_TST                (*(reg8 *) CYDEV_SLOWCLK_X32_TST)
#define SLOWCLK_X32_CFG_PTR            ( (reg8 *) CYDEV_SLOWCLK_X32_CFG)
#define SLOWCLK_X32_CFG                (*(reg8 *) CYDEV_SLOWCLK_X32_CFG)
#define SLOWCLK_ILO_CR0_PTR            ( (reg8 *) CYREG_SLOWCLK_ILO_CR0)
#define SLOWCLK_ILO_CR0                (*(reg8 *) CYREG_SLOWCLK_ILO_CR0)
#define CLKDIST_UCFG_PTR            ( (reg8 *) CYREG_CLKDIST_UCFG)
#define CLKDIST_UCFG                (*(reg8 *) CYREG_CLKDIST_UCFG)
#define SLOWCLK_X32_CR_PTR            ( (reg8 *) CYREG_SLOWCLK_X32_CR)
#define SLOWCLK_X32_CR                (*(reg8 *) CYREG_SLOWCLK_X32_CR)

#define PM_TW_CFG0_PTR                ( (reg8 *) CYREG_PM_TW_CFG0)
#define PM_TW_CFG0                    (*(reg8 *) CYREG_PM_TW_CFG0)

#define PM_TW_CFG2_PTR                ( (reg8 *) CYREG_PM_TW_CFG2)
#define PM_TW_CFG2                    (*(reg8 *) CYREG_PM_TW_CFG2)

#define CLKDIST_MSTR1_PTR           ( (reg8 *) CYREG_CLKDIST_MSTR1)
#define CLKDIST_MSTR1               (*(reg8 *) CYREG_CLKDIST_MSTR1)
#define CLKDIST_MSTR0_PTR           ( (reg8 *) CYREG_CLKDIST_MSTR0)
#define CLKDIST_MSTR0               (*(reg8 *) CYREG_CLKDIST_MSTR0)

#define CLKDIST_AMASK_PTR            ( (reg8 *) CYREG_CLKDIST_AMASK)
#define CLKDIST_AMASK                (*(reg8 *) CYREG_CLKDIST_AMASK)
#define CLKDIST_DMASK_PTR            ( (reg8 *) CYREG_CLKDIST_DMASK)
#define CLKDIST_DMASK                (*(reg8 *) CYREG_CLKDIST_DMASK)
#define CLKDIST_WRK0_PTR            ( (reg8 *) CYREG_CLKDIST_WRK0)
#define CLKDIST_WRK0                 (*(reg8 *) CYREG_CLKDIST_WRK0)
#define CLKDIST_LD_PTR                ( (reg8 *) CYREG_CLKDIST_LD)
#define CLKDIST_LD                    (*(reg8 *) CYREG_CLKDIST_LD)
#define CLKDIST_BCFG0_PTR            ( (reg8 *) CYREG_CLKDIST_BCFG0)
#define CLKDIST_BCFG0                (*(reg8 *) CYREG_CLKDIST_BCFG0)
#define CLKDIST_BCFG2_PTR            ( (reg8 *) CYREG_CLKDIST_BCFG2)
#define CLKDIST_BCFG2                (*(reg8 *) CYREG_CLKDIST_BCFG2)
#define SFR_USER_CPUCLK_DIV_PTR        ((void far *) CYREG_SFR_USER_CPUCLK_DIV)

#define FASTCLK_IMO_CR_PTR             ( (reg8 *) CYREG_FASTCLK_IMO_CR)
#define FASTCLK_IMO_CR                 (*(reg8 *) CYREG_FASTCLK_IMO_CR)
#define CLOCK_CONTROL               ((reg8 *) CYREG_CLKDIST_CR)
#define IMO_TR1_PTR                    ( (reg8 *) CYREG_IMO_TR1)
#define IMO_TR1                        (*(reg8 *) CYREG_IMO_TR1)
#define CY_USB_CR1_PTR                ( (reg8 *) CYREG_USB_CR1 )
#define CY_USB_CR1                    (*(reg8 *) CYREG_USB_CR1 )

#if (CYLIB_PSOC3_ES2 || CYLIB_PSOC3_ES3)
#define FLSHID_CUST_TABLES_IMO_3MHZ_PTR         ((void far *) CYDEV_FLSHID_CUST_TABLES_IMO_3MHZ)
#define FLSHID_CUST_TABLES_IMO_6MHZ_PTR            ((void far *) CYDEV_FLSHID_CUST_TABLES_IMO_6MHZ)
#define FLSHID_CUST_TABLES_IMO_12MHZ_PTR        ((void far *) CYDEV_FLSHID_CUST_TABLES_IMO_12MHZ)
#define FLSHID_CUST_TABLES_IMO_24MHZ_PTR        ((void far *) CYDEV_FLSHID_CUST_TABLES_IMO_24MHZ)
#define FLSHID_MFG_CFG_IMO_TR1_PTR                ((void far *) CYDEV_FLSHID_MFG_CFG_IMO_TR1)
#define FLSHID_CUST_TABLES_IMO_67MHZ_PTR        ((void far *) CYDEV_FLSHID_CUST_TABLES_IMO_67MHZ)
#define FLSHID_CUST_TABLES_IMO_80MHZ_PTR        ((void far *) CYDEV_FLSHID_CUST_TABLES_IMO_80MHZ)
#define FLSHID_CUST_TABLES_IMO_USB_PTR            ((void far *) CYDEV_FLSHID_CUST_TABLES_IMO_USB)
#else
#define FLSHID_CUST_TABLES_IMO_3MHZ_PTR         ((reg8 *) CYDEV_FLSHID_CUST_TABLES_IMO_3MHZ)
#define FLSHID_CUST_TABLES_IMO_6MHZ_PTR            ((reg8 *) CYDEV_FLSHID_CUST_TABLES_IMO_6MHZ)
#define FLSHID_CUST_TABLES_IMO_12MHZ_PTR        ((reg8 *) CYDEV_FLSHID_CUST_TABLES_IMO_12MHZ)
#define FLSHID_CUST_TABLES_IMO_24MHZ_PTR        ((reg8 *) CYDEV_FLSHID_CUST_TABLES_IMO_24MHZ)
#define FLSHID_MFG_CFG_IMO_TR1_PTR                ((reg8 *) CYDEV_FLSHID_MFG_CFG_IMO_TR1)
#define FLSHID_CUST_TABLES_IMO_67MHZ_PTR        ((reg8 *) CYDEV_FLSHID_CUST_TABLES_IMO_67MHZ)
#define FLSHID_CUST_TABLES_IMO_80MHZ_PTR        ((reg8 *) CYDEV_FLSHID_CUST_TABLES_IMO_80MHZ)
#define FLSHID_CUST_TABLES_IMO_USB_PTR            ((reg8 *) CYDEV_FLSHID_CUST_TABLES_IMO_USB)
#endif

#define CLKDIST_CR_PTR                ( (reg8 *) CYREG_CLKDIST_CR)
#define CLKDIST_CR                    (*(reg8 *) CYREG_CLKDIST_CR)
#define FASTCLK_PLL_Q_PTR           ( (reg8 *) CYREG_FASTCLK_PLL_Q)
#define FASTCLK_PLL_Q                   (*(reg8 *) CYREG_FASTCLK_PLL_Q)
#define FASTCLK_PLL_P_PTR             ( (reg8 *) CYREG_FASTCLK_PLL_P)
#define FASTCLK_PLL_P                 (*(reg8 *) CYREG_FASTCLK_PLL_P)
#define FASTCLK_PLL_CFG1_PTR        ( (reg8 *) CYREG_FASTCLK_PLL_CFG1)
#define FASTCLK_PLL_CFG1            (*(reg8 *) CYREG_FASTCLK_PLL_CFG1)
#define FASTCLK_XMHZ_CFG0_PTR       ( (reg8 *) CYREG_FASTCLK_XMHZ_CFG0)
#define FASTCLK_XMHZ_CFG0           (*(reg8 *) CYREG_FASTCLK_XMHZ_CFG0)
#define FASTCLK_XMHZ_CFG1_PTR       ( (reg8 *) CYREG_FASTCLK_XMHZ_CFG1)
#define FASTCLK_XMHZ_CFG1           (*(reg8 *) CYREG_FASTCLK_XMHZ_CFG1)
#define USB_CLKDIST_CONFIG_PTR        ( (reg8 *) CYREG_CLKDIST_UCFG)
#define USB_CLKDIST_CONFIG               (*(reg8 *) CYREG_CLKDIST_UCFG)
/* CYLIB CLOCK macros/funcs end */


